{"class_name": "Model", "config": {"name": "u-resnet50", "layers": [{"name": "data", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, 512, 3], "dtype": "float32", "sparse": false, "name": "data"}, "inbound_nodes": []}, {"name": "bn_data", "class_name": "BatchNormalization", "config": {"name": "bn_data", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["data", 0, 0, {}]]]}, {"name": "zero_padding2d_1", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["bn_data", 0, 0, {}]]]}, {"name": "conv0", "class_name": "Conv2D", "config": {"name": "conv0", "trainable": true, "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"name": "bn0", "class_name": "BatchNormalization", "config": {"name": "bn0", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"name": "relu0", "class_name": "Activation", "config": {"name": "relu0", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"name": "zero_padding2d_2", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_2", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu0", 0, 0, {}]]]}, {"name": "pooling0", "class_name": "MaxPooling2D", "config": {"name": "pooling0", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]}, {"name": "stage1_unit1_bn1", "class_name": "BatchNormalization", "config": {"name": "stage1_unit1_bn1", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["pooling0", 0, 0, {}]]]}, {"name": "stage1_unit1_relu1", "class_name": "Activation", "config": {"name": "stage1_unit1_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]]}, {"name": "stage1_unit1_conv1", "class_name": "Conv2D", "config": {"name": "stage1_unit1_conv1", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"name": "stage1_unit1_bn2", "class_name": "BatchNormalization", "config": {"name": "stage1_unit1_bn2", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]]}, {"name": "stage1_unit1_relu2", "class_name": "Activation", "config": {"name": "stage1_unit1_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_3", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_3", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]]}, {"name": "stage1_unit1_conv2", "class_name": "Conv2D", "config": {"name": "stage1_unit1_conv2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "stage1_unit1_bn3", "class_name": "BatchNormalization", "config": {"name": "stage1_unit1_bn3", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}]]]}, {"name": "stage1_unit1_relu3", "class_name": "Activation", "config": {"name": "stage1_unit1_relu3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage1_unit1_bn3", 0, 0, {}]]]}, {"name": "stage1_unit1_conv3", "class_name": "Conv2D", "config": {"name": "stage1_unit1_conv3", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage1_unit1_relu3", 0, 0, {}]]]}, {"name": "stage1_unit1_sc", "class_name": "Conv2D", "config": {"name": "stage1_unit1_sc", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["stage1_unit1_conv3", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]]}, {"name": "stage1_unit2_bn1", "class_name": "BatchNormalization", "config": {"name": "stage1_unit2_bn1", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "stage1_unit2_relu1", "class_name": "Activation", "config": {"name": "stage1_unit2_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]]}, {"name": "stage1_unit2_conv1", "class_name": "Conv2D", "config": {"name": "stage1_unit2_conv1", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]]}, {"name": "stage1_unit2_bn2", "class_name": "BatchNormalization", "config": {"name": "stage1_unit2_bn2", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]]}, {"name": "stage1_unit2_relu2", "class_name": "Activation", "config": {"name": "stage1_unit2_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_4", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_4", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]]}, {"name": "stage1_unit2_conv2", "class_name": "Conv2D", "config": {"name": "stage1_unit2_conv2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]]}, {"name": "stage1_unit2_bn3", "class_name": "BatchNormalization", "config": {"name": "stage1_unit2_bn3", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}]]]}, {"name": "stage1_unit2_relu3", "class_name": "Activation", "config": {"name": "stage1_unit2_relu3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage1_unit2_bn3", 0, 0, {}]]]}, {"name": "stage1_unit2_conv3", "class_name": "Conv2D", "config": {"name": "stage1_unit2_conv3", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage1_unit2_relu3", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["stage1_unit2_conv3", 0, 0, {}], ["add_1", 0, 0, {}]]]}, {"name": "stage1_unit3_bn1", "class_name": "BatchNormalization", "config": {"name": "stage1_unit3_bn1", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "stage1_unit3_relu1", "class_name": "Activation", "config": {"name": "stage1_unit3_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage1_unit3_bn1", 0, 0, {}]]]}, {"name": "stage1_unit3_conv1", "class_name": "Conv2D", "config": {"name": "stage1_unit3_conv1", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage1_unit3_relu1", 0, 0, {}]]]}, {"name": "stage1_unit3_bn2", "class_name": "BatchNormalization", "config": {"name": "stage1_unit3_bn2", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage1_unit3_conv1", 0, 0, {}]]]}, {"name": "stage1_unit3_relu2", "class_name": "Activation", "config": {"name": "stage1_unit3_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage1_unit3_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_5", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_5", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage1_unit3_relu2", 0, 0, {}]]]}, {"name": "stage1_unit3_conv2", "class_name": "Conv2D", "config": {"name": "stage1_unit3_conv2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]]}, {"name": "stage1_unit3_bn3", "class_name": "BatchNormalization", "config": {"name": "stage1_unit3_bn3", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage1_unit3_conv2", 0, 0, {}]]]}, {"name": "stage1_unit3_relu3", "class_name": "Activation", "config": {"name": "stage1_unit3_relu3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage1_unit3_bn3", 0, 0, {}]]]}, {"name": "stage1_unit3_conv3", "class_name": "Conv2D", "config": {"name": "stage1_unit3_conv3", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage1_unit3_relu3", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["stage1_unit3_conv3", 0, 0, {}], ["add_2", 0, 0, {}]]]}, {"name": "stage2_unit1_bn1", "class_name": "BatchNormalization", "config": {"name": "stage2_unit1_bn1", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "stage2_unit1_relu1", "class_name": "Activation", "config": {"name": "stage2_unit1_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]]}, {"name": "stage2_unit1_conv1", "class_name": "Conv2D", "config": {"name": "stage2_unit1_conv1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"name": "stage2_unit1_bn2", "class_name": "BatchNormalization", "config": {"name": "stage2_unit1_bn2", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]]}, {"name": "stage2_unit1_relu2", "class_name": "Activation", "config": {"name": "stage2_unit1_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_6", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_6", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]]}, {"name": "stage2_unit1_conv2", "class_name": "Conv2D", "config": {"name": "stage2_unit1_conv2", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]]}, {"name": "stage2_unit1_bn3", "class_name": "BatchNormalization", "config": {"name": "stage2_unit1_bn3", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}]]]}, {"name": "stage2_unit1_relu3", "class_name": "Activation", "config": {"name": "stage2_unit1_relu3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage2_unit1_bn3", 0, 0, {}]]]}, {"name": "stage2_unit1_conv3", "class_name": "Conv2D", "config": {"name": "stage2_unit1_conv3", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage2_unit1_relu3", 0, 0, {}]]]}, {"name": "stage2_unit1_sc", "class_name": "Conv2D", "config": {"name": "stage2_unit1_sc", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["stage2_unit1_conv3", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]]}, {"name": "stage2_unit2_bn1", "class_name": "BatchNormalization", "config": {"name": "stage2_unit2_bn1", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "stage2_unit2_relu1", "class_name": "Activation", "config": {"name": "stage2_unit2_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]]}, {"name": "stage2_unit2_conv1", "class_name": "Conv2D", "config": {"name": "stage2_unit2_conv1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]]}, {"name": "stage2_unit2_bn2", "class_name": "BatchNormalization", "config": {"name": "stage2_unit2_bn2", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]]}, {"name": "stage2_unit2_relu2", "class_name": "Activation", "config": {"name": "stage2_unit2_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_7", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_7", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]]}, {"name": "stage2_unit2_conv2", "class_name": "Conv2D", "config": {"name": "stage2_unit2_conv2", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]]}, {"name": "stage2_unit2_bn3", "class_name": "BatchNormalization", "config": {"name": "stage2_unit2_bn3", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}]]]}, {"name": "stage2_unit2_relu3", "class_name": "Activation", "config": {"name": "stage2_unit2_relu3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage2_unit2_bn3", 0, 0, {}]]]}, {"name": "stage2_unit2_conv3", "class_name": "Conv2D", "config": {"name": "stage2_unit2_conv3", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage2_unit2_relu3", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["stage2_unit2_conv3", 0, 0, {}], ["add_4", 0, 0, {}]]]}, {"name": "stage2_unit3_bn1", "class_name": "BatchNormalization", "config": {"name": "stage2_unit3_bn1", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "stage2_unit3_relu1", "class_name": "Activation", "config": {"name": "stage2_unit3_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage2_unit3_bn1", 0, 0, {}]]]}, {"name": "stage2_unit3_conv1", "class_name": "Conv2D", "config": {"name": "stage2_unit3_conv1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage2_unit3_relu1", 0, 0, {}]]]}, {"name": "stage2_unit3_bn2", "class_name": "BatchNormalization", "config": {"name": "stage2_unit3_bn2", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2_unit3_conv1", 0, 0, {}]]]}, {"name": "stage2_unit3_relu2", "class_name": "Activation", "config": {"name": "stage2_unit3_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage2_unit3_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_8", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_8", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage2_unit3_relu2", 0, 0, {}]]]}, {"name": "stage2_unit3_conv2", "class_name": "Conv2D", "config": {"name": "stage2_unit3_conv2", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]]}, {"name": "stage2_unit3_bn3", "class_name": "BatchNormalization", "config": {"name": "stage2_unit3_bn3", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2_unit3_conv2", 0, 0, {}]]]}, {"name": "stage2_unit3_relu3", "class_name": "Activation", "config": {"name": "stage2_unit3_relu3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage2_unit3_bn3", 0, 0, {}]]]}, {"name": "stage2_unit3_conv3", "class_name": "Conv2D", "config": {"name": "stage2_unit3_conv3", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage2_unit3_relu3", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["stage2_unit3_conv3", 0, 0, {}], ["add_5", 0, 0, {}]]]}, {"name": "stage2_unit4_bn1", "class_name": "BatchNormalization", "config": {"name": "stage2_unit4_bn1", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "stage2_unit4_relu1", "class_name": "Activation", "config": {"name": "stage2_unit4_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage2_unit4_bn1", 0, 0, {}]]]}, {"name": "stage2_unit4_conv1", "class_name": "Conv2D", "config": {"name": "stage2_unit4_conv1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage2_unit4_relu1", 0, 0, {}]]]}, {"name": "stage2_unit4_bn2", "class_name": "BatchNormalization", "config": {"name": "stage2_unit4_bn2", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2_unit4_conv1", 0, 0, {}]]]}, {"name": "stage2_unit4_relu2", "class_name": "Activation", "config": {"name": "stage2_unit4_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage2_unit4_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_9", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_9", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage2_unit4_relu2", 0, 0, {}]]]}, {"name": "stage2_unit4_conv2", "class_name": "Conv2D", "config": {"name": "stage2_unit4_conv2", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]]}, {"name": "stage2_unit4_bn3", "class_name": "BatchNormalization", "config": {"name": "stage2_unit4_bn3", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2_unit4_conv2", 0, 0, {}]]]}, {"name": "stage2_unit4_relu3", "class_name": "Activation", "config": {"name": "stage2_unit4_relu3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage2_unit4_bn3", 0, 0, {}]]]}, {"name": "stage2_unit4_conv3", "class_name": "Conv2D", "config": {"name": "stage2_unit4_conv3", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage2_unit4_relu3", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true}, "inbound_nodes": [[["stage2_unit4_conv3", 0, 0, {}], ["add_6", 0, 0, {}]]]}, {"name": "stage3_unit1_bn1", "class_name": "BatchNormalization", "config": {"name": "stage3_unit1_bn1", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "stage3_unit1_relu1", "class_name": "Activation", "config": {"name": "stage3_unit1_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]]}, {"name": "stage3_unit1_conv1", "class_name": "Conv2D", "config": {"name": "stage3_unit1_conv1", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"name": "stage3_unit1_bn2", "class_name": "BatchNormalization", "config": {"name": "stage3_unit1_bn2", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]]}, {"name": "stage3_unit1_relu2", "class_name": "Activation", "config": {"name": "stage3_unit1_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_10", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_10", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]]}, {"name": "stage3_unit1_conv2", "class_name": "Conv2D", "config": {"name": "stage3_unit1_conv2", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]]}, {"name": "stage3_unit1_bn3", "class_name": "BatchNormalization", "config": {"name": "stage3_unit1_bn3", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage3_unit1_conv2", 0, 0, {}]]]}, {"name": "stage3_unit1_relu3", "class_name": "Activation", "config": {"name": "stage3_unit1_relu3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage3_unit1_bn3", 0, 0, {}]]]}, {"name": "stage3_unit1_conv3", "class_name": "Conv2D", "config": {"name": "stage3_unit1_conv3", "trainable": true, "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage3_unit1_relu3", 0, 0, {}]]]}, {"name": "stage3_unit1_sc", "class_name": "Conv2D", "config": {"name": "stage3_unit1_sc", "trainable": true, "filters": 1024, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true}, "inbound_nodes": [[["stage3_unit1_conv3", 0, 0, {}], ["stage3_unit1_sc", 0, 0, {}]]]}, {"name": "stage3_unit2_bn1", "class_name": "BatchNormalization", "config": {"name": "stage3_unit2_bn1", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "stage3_unit2_relu1", "class_name": "Activation", "config": {"name": "stage3_unit2_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage3_unit2_bn1", 0, 0, {}]]]}, {"name": "stage3_unit2_conv1", "class_name": "Conv2D", "config": {"name": "stage3_unit2_conv1", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage3_unit2_relu1", 0, 0, {}]]]}, {"name": "stage3_unit2_bn2", "class_name": "BatchNormalization", "config": {"name": "stage3_unit2_bn2", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage3_unit2_conv1", 0, 0, {}]]]}, {"name": "stage3_unit2_relu2", "class_name": "Activation", "config": {"name": "stage3_unit2_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage3_unit2_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_11", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_11", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage3_unit2_relu2", 0, 0, {}]]]}, {"name": "stage3_unit2_conv2", "class_name": "Conv2D", "config": {"name": "stage3_unit2_conv2", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_11", 0, 0, {}]]]}, {"name": "stage3_unit2_bn3", "class_name": "BatchNormalization", "config": {"name": "stage3_unit2_bn3", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage3_unit2_conv2", 0, 0, {}]]]}, {"name": "stage3_unit2_relu3", "class_name": "Activation", "config": {"name": "stage3_unit2_relu3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage3_unit2_bn3", 0, 0, {}]]]}, {"name": "stage3_unit2_conv3", "class_name": "Conv2D", "config": {"name": "stage3_unit2_conv3", "trainable": true, "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage3_unit2_relu3", 0, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"name": "add_9", "trainable": true}, "inbound_nodes": [[["stage3_unit2_conv3", 0, 0, {}], ["add_8", 0, 0, {}]]]}, {"name": "stage3_unit3_bn1", "class_name": "BatchNormalization", "config": {"name": "stage3_unit3_bn1", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "stage3_unit3_relu1", "class_name": "Activation", "config": {"name": "stage3_unit3_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage3_unit3_bn1", 0, 0, {}]]]}, {"name": "stage3_unit3_conv1", "class_name": "Conv2D", "config": {"name": "stage3_unit3_conv1", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": 